<?php

use yii\helpers\Html;

$policyLink = Html::a('политики конфиденциальности', '#', [
	'data-toggle' => 'collapse',
	'data-target' => '#privacypolicy'
]);

?>

<?= Html::tag('hr', null) ?>

<?= Html::tag('p', "Отправляя данную форму Вы принимете условия $policyLink"); ?>

<ol id="privacypolicy" class="collapse">

	<li>Пользователь, регистрирующийся на сайте «болх.бе» c целью публикации резюме, вакансий, компаний или участия в иных проектах «болх.бе» и получения доступа к сервисам «болх.бе», тем самым выражает свое полное согласие в соответствии со статьей 9 Федерального закона от 27 июля 2006 г. № 152-ФЗ "О персональных данных" на автоматизированную, а также без использования средств автоматизации, обработку и использование своих персональных данных.</li>

	<li>Пользователь гарантирует достоверность предоставленных персональных данных и то, что персональные данные принадлежат Пользователю.</li>

	<li>В случае предъявления третьими лицами любых претензий в адрес «болх.бе», связанных с обработкой и использованием персональных данных пользователя, такой пользователь обязуется своими силами и за свой счет урегулировать указанные претензии с третьими лицами.</li>

	<li>«болх.бе» вправе отказать Пользователю в регистрации без объяснения причин отказа. При этом персональные данные Пользователя удаляются.</li>

	<li>«болх.бе» вправе использовать персональные данные пользователей в порядке, предусмотренном действующим законодательством.</li>

	<li>Лица, считающие, что их права и интересы нарушены в результате обработки и использования персональных данных, направляют претензии по адресу электронной почты bolhbe@gmail.com.</li>

	<li>Настоящее согласие может быть отозвано Пользователем в письменной форме. </li>

	<li>Настоящее согласие действует до даты его отзыва Пользователем путем направления в «болх.бе» письменного сообщения об указанном отзыве в произвольной  форме, если  иное не установлено законодательством Российской Федерации.</li>

	<li>Пользователь подтверждает факт ознакомления с требованиями Федерального закона от 27.07.2006 №152-ФЗ «О персональных данных», и в полной мере осознает и понимает права и обязанности в области защиты персональных данных.</li>

	<li>Пользователь осознает, что в случае авторизации на сайтах «болх.бе» посредством учетных записей социальных сетей, на него распространяются правила и условия соответствующих социальных сетей, в том числе в части обработки и использования персональных данных и обеспечения их конфиденциальности.</li>

</ol>