<?php

use \yii\helpers\Html;

?>

<div class="visible-md-block visible-lg-block">

	<p>
		Знания, талант, навыки, креативность, упорство и подобные факторы двигают коммерцию к развитию. В одном человеке могут присутствовать одни качества, другие воплощаются в другом.
	</p>

	<p>
		Хотя один человек одновременно и может выполнять работу бухгалтера, продавца, системного администратора, охранника и директора, но в интересах развития важно разделять задачи между теми кто знает и любит свое дело.
	</p>

	<p>
		Самые разные специалисты публикуют резюме и сами <?= Html::a('ищут работу', null, ['ui-sref' => 'resume>list']) ?>, что существенно упрощает жизнь работадателя.
	</p>

	<p>
		Мы в болх.бе убеждены, что управленец, публикующий вакансии, приглашающий на собеседования, нанимающий на работу стремится к развитию своего предприятия.
	</p>

	<p>
		Публикуйте вакансии <?= Html::tag('strong', 'это бесплатно') ?>!
	</p>

</div>
