<?php

use \yii\helpers\Html;

?>

<div class="visible-md-block visible-lg-block">

	<p>
		В современных условиях <?= Html::a('поиск работы', null, ['ui-sref' => 'vacancy>list']) ?> не представим без наличия резюме.
	</p>

	<p>
		Резюме быстро выделяет подходящего из многих <?= Html::tag('strong', 'специалистов') ?> смежного профиля.
		При грамотном оформлении резюме настоящая стоимость профессионала - очевидна.
	</p>

	<p>
		Работодатель оценит кандидата на основе опыта работы, образования и профессиональных навыков.
	</p>

	<p>
		Если работодателю резюме служит инструментом первичного знакомства, то соискателю - билет на работу. Вот почему важно отнестись основательно к <?= Html::tag('strong', 'составлению резюме') ?>.
	</p>

	<p>
		Публикуйте резюме и делайте это грамотно, это способствует вашему трудоустройству.
	</p>

</div>